let age = Number(prompt('Вкажіть рік свого народження'));
if (!age) {
  alert ('Шкода, що Ви не захотіли ввести свій рік народження');
}

let city = prompt('Вкажіть місто, в якому Ви мешкаєте');
if (!city) {
  alert ('Шкода, що Ви не захотіли ввести місто, де Ви мешкаєте');
}

let sport = prompt('Вкажіть свій улюблений вид спорту');
if (!sport) {
  alert ('Шкода, що Ви не захотіли ввести свій улюблений вид спорту');
}

let calculateAge = (2023 - age);

if (city === 'Київ') { 
  city = 'Ви живете у столиці України';
} else if (city === 'Вашингтон') {
  city = 'Ви живете у столиці США';
} else if (city === 'Лондон') {
  city = 'Ви живете у столиці Сполученого Королівства';
} else {
  city = 'Ви живете у місті' + ' ' + city;
}

if (sport === 'Футбол') {
  sport = 'Круто! Хочете стати як Ліонель Мессі?';
} else if (sport === 'Бокс') {
  sport = 'Круто! Хочете стати як брати Кличко?';
} else if (sport === 'Теніс') {
  sport = 'Круто! Хочете стати як Еліна Світоліна?';
};

alert (`
    - Зараз Вам ${calculateAge} років
    - ${city}
    - ${sport}
`);